Autodesk.Revit.DB.Electrical.PowerFactorStateType
An enumerated type listing all the possible power factor state types for a connector object.

Autodesk.Revit.DB.Electrical.PowerFactorStateType.Lagging
Power FactorState Type is Lagging.

Autodesk.Revit.DB.Electrical.PowerFactorStateType.Leading
Power FactorState Type is Leading.